//ветвления
// price (цена товара) и quantity (количество товара).
// формула чтобы подсчитать колличество купленых товаров и общая сума

let price = 6.39;
let quantity = 81;
number = price * quantity;
console.log(+number.toFixed(2));

// {"a": 20, "b": -4, "c": 83}.
// вывести наименьшее число

const a = 20;
const b = -4;
const c = 83;
function getMinNumber(max) {
  return Math.min(a, b, c);
}

console.log(getMinNumber);

// вывести рандомное целое число
//{"min": 1, "max": 6}
const min = 1;
const max = 6;

function getRandomInt(max) {
  return Math.floor(Math.random() * (max - min + 1) + min);
}

console.log(getRandomInt);

// вывести значение () в строке ''  или "" ставиться '+ count + '
// только при косых ковычках ставиться ${count} - тут можно делать математическое вырожение, например: ${count + 1}
const count = 10;
console.log(" У меня есть " + count + " яблок ");
console.log(` У меня есть ${count} яблок `);

// сделать из строки число добавить + перед prompt
const num = +prompt("Введите число");
console.log(
  `Если к числу ${num} прибавить число 5, то получиться = ${num + 5}`
);

//На практике лучше использовать строгое равенство === и неравенство !==. И при необходимости проводить преобразования явно.

console.log(2 == "2"); // true
console.log(2 === +"2"); // true
console.log((2).toString() === "2"); // true

//Кроме стандартных операторов сравнения, в JavaScript есть метод Object.is(),
//который позволяет сравнивать значения более строго, чем ===.
//Этот метод учитывает некоторые особенности, такие как различие между +0 и -0, а также NaN,
//который считается равным только самому себе.
//Использование Object.is() может быть полезно в ситуациях, когда вам нужно более точно определить равенство значений.
//Например:

console.log(0 === -0); // true
console.log(Object.is(0, -0)); // false

console.log(NaN === NaN); // false
console.log(Object.is(NaN, NaN)); // true

console.log((10 - 2) * 3 + 4 / 2);

if (size == null) {
  console.log("Вы не выбрали размер!");
} else {
  const normSize = size.toString().trim().toLowerCase(); // убераем лишние пробелы и проверка на маленькиие, большие буквы

  if (normSize === "маленькая") {
    console.log("Маленькая пицца стоит 800 руб.");
  } else if (normSize === "средняя") {
    console.log("Средняя пицца стоит 1200 руб.");
  } else if (normSize === "большая") {
    console.log("Большая пицца стоит 1500 руб.");
  } else {
    console.log("Такого размера у нас нет!");
  }
}

// конструкция switch

switch (animal) {
  case "кошка":
  case "собака":
  case "хомяк":
    console.log("Это домашнее животное.");
    break;
  case "рыба":
  case "птица":
  case "черепаха":
  case "ящерица":
    console.log("Это экзотический питомец.");
    break;
  default:
    console.log("Это мне неизвестно.");
}

const answer = prompt("Вам нравиться Js💛?");

if (answer === "Да") {
  alert("Конечно, отличный язык.");
} else if (answer === "Нет") {
  alert("Не нравится? Вы кнопкой ошиблись?");
}

const userName = prompt("Как тебя зовут?");

if (userName && userName.trim()) {
  // .trim() - убирает пустые пробелы
  alert(`Привет ${userName.trim()}`);
} else {
  alert("Введено неверное имя.");
}

const ageName = +prompt("Сколько тебе лет?");

if (ageName > 18) {
  console.log("Привет :)");
} else if (ageName < 50) {
  console.log("Здравствуйте");
} else if (ageName < 100) {
  console.log("Почетный возраст");
} else {
  console.log("А столько живут?");
}

const course_b54 = "Мышка Б54";
const keyboard_k55 = "Клавиатура К22";
const monitor_m123 = "Монитор М123";
const price_1 = 2200;
const price_2 = 9400;
const price_3 = 52000;
const userproduct = prompt("Введите название товара").toLowerCase().trim();

if(userproduct === course_b54.toLowerCase().trim()){
    alert(`"${course_b54}":${price_1}`);
}
else if(userproduct === keyboard_k55.toLowerCase().trim()){
    alert(`"${keyboard_k55}":${price_2}`);
}
else if(userproduct === monitor_m123.toLowerCase().trim()){
    alert(`"${monitor_m123}":${price_3}`);
}
else {
    alert(`Товар "${userproduct}" не найден.`);
}

//формула - Math.floor(Math.random() * (max - min + 1) + min);
const numrandom = Math.floor(Math.random() * (5 - 1 + 1) + 1);
const userNum = +prompt("Я загадал число от 1 до 5. Сможешь отгадать?");

if (!Number.isInteger(userNum) || userNum < 1 || userNum > 5) {
    alert("Необходимо было ввести целое число от 1 до 5 включительно.");
} else if (userNum === numrandom) {
    alert(`Верно, я загадал число ${numrandom}.`);
} else {
    alert(`Нет, не ${userNum}, я загадал число ${numrandom}.`);
}
